app/views/users/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 1]]
---
<div class="index-gallery">
<% u.photos.take(3).each do |p| %>