app/views/users/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 1]]
---
<small><%= link_to "Back to all users", users_path %></small>
<% @user.photos.each do |photo| %>