app/views/photos/show.html.erb

SELECT  1 AS one FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."photo_id" = $1 AND "users"."id" = $2 LIMIT $3  [["photo_id", 1], ["id", 3], ["LIMIT", 1]]
---
  <% if current_user %>
    <% if @photo.users.include? current_user %>

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = $1  [["photo_id", 1]]
---
  <h3>Comments</h3>
  <% if @photo.comments.length == 0 %>