app/controllers/comments_controller.rb

  def create
    if !current_user
      flash[:alert] = "Not authorized to create a comment."
    else
      @photo = Photo.find(params[:photo_id])
      @comment = @photo.comments.create(comment_params.merge(user: current_user))
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "photo_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hello, world!"], ["photo_id", 1], ["user_id", 3], ["created_at", "2017-11-29 21:17:38.796498"], ["updated_at", "2017-11-29 21:17:38.796498"]]

  def edit
    @user = User.find(params[:user_id])
    @photo = Photo.find(params[:photo_id])
    @comment = Comment.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

  def update
    @photo = Photo.find(params[:photo_id])
    @comment = Comment.find(params[:id])
    if @comment.user != current_user
      flash[:alert] = "Not authorized to edit this comment."
    else
      @comment.update(comment_params)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "Fantastic photo"], ["updated_at", "2017-11-30 14:10:27.342685"], ["id", 12]]

  def destroy
    @photo = Photo.find(params[:photo_id])
    @comment = Comment.find(params[:id])
    if @comment.user != current_user
      flash[:alert] = "Not authorized to delete this comment."
    else
      @comment.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]