app/controllers/photos_controller.rb

  def show
    @user = User.find(params[:user_id])
    @photo = Photo.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.find(params[:user_id])
    if current_user
      @photo = @user.photos.create(photo_params.merge(user: current_user))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "photos" ("title", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Glover Park"], ["url", "10.jpg"], ["user_id", 1], ["created_at", "2017-11-27 15:01:23.535040"], ["updated_at", "2017-11-27 15:01:23.535040"]]

  def edit
    @user = User.find(params[:user_id])
    @photo = Photo.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def update
    @user = User.find(params[:user_id])
    @photo = Photo.find(params[:id])

    if @photo.user == current_user
      @photo.update(photo_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "photos" SET "title" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["title", "Winter in Rehoboth"], ["updated_at", "2017-11-27 15:19:54.881135"], ["id", 2]]

  def destroy
    @user = User.find(params[:user_id])
    @photo = Photo.find(params[:id])

    if @photo.user == current_user
      @photo.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 12]]

  def add_favorite
    @user = current_user
    @photo = Photo.find(params[:id])

    if current_user
      Favorite.create(user: @user, photo: @photo)
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "photo_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["photo_id", 1], ["created_at", "2017-11-29 23:05:10.576059"], ["updated_at", "2017-11-29 23:05:10.576059"]]

  def remove_favorite
    @user = current_user
    @photo = Photo.find(params[:id])

    if current_user
      Favorite.find_by(user: @user, photo: @photo).destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = 3 AND "favorites"."photo_id" = 1 LIMIT $1  [["LIMIT", 1]]