app/controllers/users_controller.rb

  def frontpage
    @photos = Photo.order("RANDOM()").limit(9)
---
SELECT "photos".* FROM "photos"

  def index
    @users = User.all.order("username ASC")
---
SELECT "users".* FROM "users" ORDER BY username DESC